[
  {
    "company": "DataArt (Cliente sector financiero en NY)",
    "title": "Desarrollador .NET Fullstack SR en equipo distribuido globalmente",
    "dateFrom": "2022-05-16",
    "dateTo": null,
    "tasks": [
      "Referente principal de proyecto Rest API.",
      "Desarrollo de nuevos servicios WCF",
      "Desarrollo de nuevo servicio en segundo plano integrando un servicio API externo",
      "Mantenimiento y desarrollo de mejoras en Windows Services y WCF Services",
      "Mantenimiento y desarrollo de mejoras en Applicación WPF",
      "Deploy de servicios en los diferentes ambientes de desarrollo",
      "Mantener comunicación con el cliente",
      "Uso de Jira Software para administración de tareas y tickets"
    ]
  },
  {
    "company": "Cognizant SoftVision",
    "title": "Desarrollador .NET Fullstack SSR en equipo distribuido globalmente",
    "dateFrom": "2022-01-25",
    "dateTo": "2022-05-13",
    "tasks": [
      "Desarrollo de mantenimiento, mejoras y nuevas funcionalidades en el frontend con ReactJS.",
      "Desarrollo de mantenimiento, mejoras y nuevas funcionalidades en el backend (API REST) con C# y .NET Core.",
      "Pruebas unitarias y de integración utilizando BDD y TDD.",
      "Mantenimiento y adición de documentación del código y del sistema",
      "Uso de Azure devops para administración de tareas y tickets"
    ]
  },
  {
    "company": "Accusys Technology",
    "title": "Analista Programador .NET",
    "dateFrom": "2021-01-01",
    "dateTo": "2022-01-24",
    "tasks": [
      "Mantenimiento a Aplicación Mobile con C# utilizando Xamarin Forms y patrón MVVM.",
      "Desarrollo de mejoras y nuevas funcionalidades a aplicación en 3 servicios. Backend service, Aplicación de consola y Aplicación Web con ASP .NET MVC. Front end con razor y acceso a datos con Entity Framework.",
      "Desarrollo de aplicMantenimiento y mejoras a aplicación web desarrollada con Web Forms. Front End desarrollado en hojas xsl, funcionalidad en Javascript y acceso a datos con ADO .NET.",
      "Desarrollo de software de escritorio en C# y VB .NET. Front End desarrollado con Windows Forms y acceso a datos con ADO .NET consumiendo Stored Procedures.",
      "Desarrollo de aplicaciones de consola y servicios de Windows con C# .NET y .NET Core.",
      "Manejo de complejas bases de datos y uso de Stored Procedures.",
      "Uso de Azure devops para administración de tareas y tickets"
    ]
  },
  {
    "company": "Garmin Argentina",
    "title": "Representante de atención al público",
    "dateFrom": "2017-11-24",
    "dateTo": "2021-01-01",
    "tasks": [
      "Ventas",
      "Atención al público",
      "Asesoramiento comercial"
    ]
  },
  {
    "company": "Tati Golf / Adidas Golf Argentina",
    "title": "Encargado de E-Commerce",
    "dateFrom": "2013-01-01",
    "dateTo": "2017-04-30",
    "tasks": [
      "Manejo y mantenimiento de publicaciones en el sitio web.",
      "Manejo y mantenimiento de publicaciones en Tienda Oficial de Mercado Libre.",
      "Ventas.",
      "Atención al público.",
      "Asesoramiento comercial.",
      "Manejo de caja."
    ]
  }
]
